#include "Tree.hpp"


/*========================================================*/
/*===================== Конструкторы =====================*/
/*========================================================*/

// Конструктор с параметрами[+ по умолчанию]
Tree::Tree(std::string sName, TreeType sType, int64_t sAge) : name(sName), type(sType), age(sAge) 
{}


/*========================================================*/
/*======================== Методы ========================*/
/*========================================================*/

// Метод вывода в поток
std::ostream& Tree::print(std::ostream& out)
{
    out << "Name: " << this->name << std::endl;
    out << "Type: " << (this->type == TreeType::Coniferous ? "Coniferous" : "Deciduous") << std::endl;
    out << "Age: " << this->age << std::endl;

    return out; 
}


/*========================================================*/
/*======================== Гетеры ========================*/
/*========================================================*/

// Метод получения имени
std::string Tree::getName() const
{
    return this->name;
}

// Метод получения возраста
size_t Tree::getAge() const
{
    return this->age;
}

// Метод получения типа
TreeType Tree::getType() const
{
    return this->type;
}
